Tekla Open API Reference for Tekla Structures 2025
OpenGraphicObjectAttributes Methods
The OpenGraphicObject.OpenGraphicObjectAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Inherited from AttributesBase.)
LoadAttributes
 Loads the attributes from the specified file.
 (Inherited from AttributesBase.)
Top
See Also
Reference
OpenGraphicObject.OpenGraphicObjectAttributes Class
Tekla.Structures.Drawing Namespace